# DIFFERENT WAYS OF CREATING DATAFRAME

1. Using CSV/EXCEL
2. Using Python Dictionary
3. Using Tuple List
4. Using Dictionary List

In [2]:
# Directly read the CSV

import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [4]:
df = pd.read_excel('weather_data.xlsx','Sheet1')
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [6]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain','Sunny','Snow']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [7]:
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]

df = pd.DataFrame(weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [9]:
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
]

df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

# READ and WRITE EXCEL CSV FILES

1. Read CSV
2. Write CSV
3. Read Excel
4. Write Excel

# READ CSV

In [1]:
import pandas as pd
df = pd.read_csv('stock_data.csv', header=None, names=['ticker','eps','revenue','price','people'])
df

        ticker            eps  revenue  price         people
0  stocks data            NaN      NaN    NaN            NaN
1      tickers            eps  revenue  price         people
2        GOOGL          27.82       87    845     larry page
3          WMT           4.61      484     65           n.a.
4         MSFT             -1       85     64     bill gates
5         RIL   not available       50   1023  mukesh ambani
6         TATA            5.6       -1   n.a.     ratan tata

In [6]:
df1 = pd.read_csv('stock_data.csv', skiprows=1)
df1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [8]:
df2 = pd.read_csv('stock_data.csv', skiprows=1, nrows=3)
df2

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [11]:
df3 = pd.read_csv('stock_data.csv', skiprows=1, na_values={
    'eps': ["not available","n.a."],
    'revenue': ["not available","n.a.",-1],
    'people': ["not available","n.a."],
    })
df3

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# WRITE CSV

In [14]:
df3.to_csv('rev.csv', index=False)

In [15]:
df3.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [17]:
df3.to_csv('tickeps.csv', header=False, columns=['tickers','eps'])

# READ EXCEL

In [1]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell

def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell
    
import pandas as pd
df4 = pd.read_excel('stock_data.xlsx','Sheet1', converters = {
        'people': convert_people_cell,
        'eps': convert_eps_cell
    })
df4

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

# WRITE EXCEL

In [4]:
df4.to_excel("rev.xlsx", sheet_name="stocks", startrow=1, startcol=2, index=False)

# EXCEL WRITER

In [7]:
import pandas as pd

df_stocks = pd.DataFrame({
    'tickers': ['GOOGL','WMT','MSFT'],
    'price' : [845, 65, 64],
    'pe' : [30.37, 14.26, 30.97],
    'eps' : [27.82, 4.61, 2.12]
})

df_weather = pd.DataFrame({
    'day' : ['1/12017', '1/2/2017', '1/3/2017'],
    'temperature' : [32,35,28],
    'event' : ['Rain', 'Sunny', 'Snow']
})

In [8]:
with pd.ExcelWriter('stock_weathers.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")